src/main/resources/ContactExample.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <notifications xmlns="http://soap.sforce.com/2005/09/outbound">
            <OrganizationId>00D20000000nW7aEAE</OrganizationId>
            <ActionId>04k200000001DnjAAE</ActionId>
            <SessionId xsi:nil="true"/>
            <EnterpriseUrl>https://emea.salesforce.com/services/Soap/c/31.0/00D20000000nW7a</EnterpriseUrl>
            <PartnerUrl>https://emea.salesforce.com/services/Soap/u/31.0/00D20000000nW7a</PartnerUrl>
            <Notification>
                <Id>04l2000000KFjMbAAL</Id>
                <sObject xsi:type="sf:Contact" xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
                    <sf:Id>0032000001GgOe4AAF</sf:Id>
                    <sf:AccountId>0012000001BJaC6AAL</sf:AccountId>
                    <sf:Description>Description</sf:Description>
                    <sf:FirstName>Christian</sf:FirstName>
                    <sf:Email>Christian@christian.com</sf:Email>
                    <sf:LastModifiedDate>2014-08-19T10:47:05.000Z</sf:LastModifiedDate>
                    <sf:LastName>Lehmann</sf:LastName>
                </sObject>
            </Notification>
        </notifications>
    </soapenv:Body>
</soapenv:Envelope>